---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomUnplaceWarning
source: html/6de63393-1fd3-937a-de8b-bf486105cfe4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomUnplaceWarning Property

A Room was deleted from all model views but still remains in this project. \n The room can be removed from any schedule or placed back in the model using the Room command.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomUnplaceWarning { get; }
```